
&НаСервереБезконтекста
Функция ПолучитьДатуАттестации(Баллон)
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МГС_АттестацияБаллоновСрезПоследних.ДатаСледующейАттестации КАК ДатаСледующейАттестации
		|ИЗ
		|	РегистрСведений.МГС_АттестацияБаллонов.СрезПоследних(, Баллон = &Баллон) КАК МГС_АттестацияБаллоновСрезПоследних";
	
	Запрос.УстановитьПараметр("Баллон", Баллон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Возврат  ВыборкаДетальныеЗаписи.ДатаСледующейАттестации
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	НомерПартии = Параметры.НомерПартии;
	ТипБаллона = Параметры.ТипБаллона;
	ТипВыпуска = Параметры.ТипВыпуска;
	Закрыта  = Параметры.Закрыта;
	Колпак  = Параметры.Колпак;
	Кольца  = Параметры.Кольца;
	ПереченьБаллонов= Параметры.ПереченьБаллонов;
	ПереченьВесов= Параметры.ПереченьВесов;
	ОтветственныйЗаПартию = Параметры.ОтветственныйЗаПартию;
	Для Н =1 По 20 Цикл
		Если ЗначениеЗаполнено( ПереченьБаллонов[Н-1]) Тогда
			НоваяСтрокаБаллоны =  Баллоны.Добавить();
			НоваяСтрокаБаллоны.Баллон = ПереченьБаллонов[Н-1];
			НоваяСтрокаБаллоны.Вес =ПереченьВесов[Н-1];
			НоваяСтрокаБаллоны.ДатаАттестации =ПолучитьДатуАттестации(НоваяСтрокаБаллоны.Баллон);
			НоваяСтрокаБаллоны.НомерСтроки = Н; 
		КонецЕсли;		
	КонецЦикла;
	ПеренестиВДокумент = Ложь;
	ОбновитьТекстКнопкиЗакрытьПартию()
КонецПроцедуры




&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//Вставить содержимое обработчика
	
	Если ПеренестиВДокумент Тогда		
		// Вставить содержимое обработчика.
		СтруктураРезультат = Новый Структура();
		СтруктураРезультат.Вставить("НомерПартии", НомерПартии);
		СтруктураРезультат.Вставить("ТипБаллона",               ТипБаллона);
		СтруктураРезультат.Вставить("ОтветственныйЗаПартию",               ОтветственныйЗаПартию);
		СтруктураРезультат.Вставить("Закрыта",               Закрыта);
		СтруктураРезультат.Вставить("Колпак",               Колпак);
		СтруктураРезультат.Вставить("Кольца",               Кольца);
		ПереченьБаллонов = Новый Массив;
		ПереченьВесов = Новый Массив;
		Для Н =1 По 20 Цикл
			Если Н<=Баллоны.Количество() Тогда
				строкаБаллон = Баллоны[Н-1];
				ПереченьБаллонов.Добавить(строкаБаллон.Баллон);
				ПереченьВесов.Добавить(строкаБаллон.Вес);
			Иначе
				ПереченьБаллонов.Добавить(Неопределено);
				ПереченьВесов.Добавить(0);
			КонецЕсли;
		КонецЦикла;
		СтруктураРезультат.Вставить("ПереченьБаллонов", ПереченьБаллонов);
		СтруктураРезультат.Вставить("ПереченьВесов", ПереченьВесов);
		
		ОповеститьОВыборе(СтруктураРезультат);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	// Вставить содержимое обработчика.
	ПеренестиВДокумент = Истина;
	Закрыть();
	
КонецПроцедуры

Процедура ОбновитьТекстКнопкиЗакрытьПартию()
	Если Закрыта Тогда
		Элементы.ЗакрытьПартию.Заголовок = "Открыть партию"
	Иначе
		Элементы.ЗакрытьПартию.Заголовок = "Закрыть партию"
	КонецЕсли;
КонецПроцедуры

&НаСервереБезконтекста
Функция ЭтоМедицинскийВыпуск(Тип)
	Если Тип = Справочники.МГС_ТипыВыпускаБаллонов.Медицинский Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗакрытьПартию(Команда)
	// Вставить содержимое обработчика.
	МожноЗакрытьПартию = Истина;
	Если ЭтоМедицинскийВыпуск(ТипВыпуска) Тогда
		Если Баллоны.Количество()<>20 Тогда
			ПоказатьПредупреждение(,"Для закрытия партии нужно указать 20 баллонов, сейчас указано " + Баллоны.Количество());
			МожноЗакрытьПартию = Ложь;
		КонецЕсли;
	КонецЕсли;	
		
	Если Не Закрыта и МожноЗакрытьПартию Тогда
		Закрыта = Истина 
	ИначеЕсли Закрыта Тогда
		Закрыта = Ложь
	КонецЕсли;
	
	ОбновитьТекстКнопкиЗакрытьПартию()
КонецПроцедуры

&НаКлиенте
Процедура БаллоныБаллонПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	//Баллоны.Количество()
	ТекущиеДанные = Элементы.Баллоны.ТекущиеДанные;
	ТекущаяСтрока = Элементы.Баллоны.ТекущаяСтрока;
	ТекущиеДанные.ДатаАттестации = ПолучитьДатуАттестации(ТекущиеДанные.Баллон);
	ТекущиеДанные.НомерСтроки = Баллоны.Количество(); 
КонецПроцедуры

&НаКлиенте
Процедура БаллоныПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
	Если Баллоны.Количество()>= 20 Тогда
			ПоказатьПредупреждение(,"Количество строк превышает 20 " );	
			Отказ = Истина
	КонецЕсли;
КонецПроцедуры



