Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр МГС_ВыпускБаллонов
	Движения.МГС_ВыпускБаллонов.Записывать = Истина;
	Для Каждого ТекСтрокаПартииБаллоны Из ПартииБаллоны Цикл
		Для Н=1 по 20 Цикл
			Если ЗначениеЗаполнено(ТекСтрокаПартииБаллоны["Баллон"+Н]) Тогда
				Движение = Движения.МГС_ВыпускБаллонов.Добавить();
				Движение.Период = Дата;
				Движение.Баллон = ТекСтрокаПартииБаллоны["Баллон"+Н];
				Движение.Партия = ТекСтрокаПартииБаллоны.НомерПартии;
				Движение.Выпуск = Ссылка;
				Движение.Состояние = Перечисления.МГС_СостояниеБаллона.Выпущено;
				Движение.Номенклатура = ТекСтрокаПартииБаллоны.Номенклатура;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ГодМесяцСтрока= Формат(Дата,"ДФ=yy") +Формат(Дата,"ДФ=MM")  ;
	// Вставить содержимое обработчика.
	Если ТипВыпуска = Справочники.МГС_ТипыВыпускаБаллонов.Медицинский Тогда 
		Префикс = "ММ00-"+ГодМесяцСтрока
	иначе
		Префикс = "МП00-"+ГодМесяцСтрока
	КонецЕсли;		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СчетчикБаллонов = 0;
	Для каждого СтрокаПартииБаллоны из ПартииБаллоны Цикл
		СчетчикБаллоновВПартии = 0;
		Для Н =1 По 20 Цикл
			Если ЗначениеЗаполнено(СтрокаПартииБаллоны["Баллон"+н] ) Тогда
				СчетчикБаллонов = СчетчикБаллонов+1;
				СчетчикБаллоновВПартии = СчетчикБаллоновВПартии+1;
			КонецЕсли;	
			//	строкаПартииБаллоны["Вес"+н]=ПереченьВесов[Н-1] ;
		КонецЦикла;
		Если СчетчикБаллоновВПартии = 0 Тогда
			Сообщение_ = Новый СообщениеПользователю;
			Сообщение_.Текст = "В партии " +Строка(СтрокаПартииБаллоны.НомерПартии)+ " не выбраны баллоны (партию нужно удалить)";
			Сообщение_.Сообщить();
			Отказ = истина;
		КонецЕсли;
	КонецЦикла;
	Если ТипВыпуска = Справочники.МГС_ТипыВыпускаБаллонов.Медицинский Тогда
		Если СчетчикБаллонов <> КоличествоБаллонов Тогда
			Сообщение_ = Новый СообщениеПользователю;
			Сообщение_.Текст = "В выпуске должно быть " +КоличествоБаллонов+ " баллонов, введено только "+СчетчикБаллонов;
			Сообщение_.Сообщить();
			Отказ = истина;
		КонецЕсли;
	КонецЕсли;	
	
	// проверим чтобы номера партии были уникальны
	НомераПартий = ПартииБаллоны.ВыгрузитьКолонку("НомерПартии");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МГС_ВыпускБаллоновПартииБаллоны.НомерПартии КАК НомерПартии,
		|	МГС_ВыпускБаллоновПартииБаллоны.Ссылка КАК Ссылка,
		|	МГС_ВыпускБаллоновПартииБаллоны.Ссылка.Представление КАК Представление
		|ИЗ
		|	Документ.МГС_ВыпускБаллонов.ПартииБаллоны КАК МГС_ВыпускБаллоновПартииБаллоны
		|ГДЕ
		|	МГС_ВыпускБаллоновПартииБаллоны.Ссылка.ТипВыпуска = &ТипВыпуска
		|	И МГС_ВыпускБаллоновПартииБаллоны.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И МГС_ВыпускБаллоновПартииБаллоны.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И МГС_ВыпускБаллоновПартииБаллоны.НомерПартии В(&НомераПартий)
		|	И МГС_ВыпускБаллоновПартииБаллоны.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(дата));
	Запрос.УстановитьПараметр("ТипВыпуска", Ссылка.ТипВыпуска);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НомераПартий", НомераПартий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщение_ = Новый СообщениеПользователю;
			Сообщение_.Текст = "Номер партии " +Строка(ВыборкаДетальныеЗаписи.НомерПартии)
			+ " уже использован в выпуске "+ВыборкаДетальныеЗаписи.Представление;
			Сообщение_.Сообщить();
			Отказ = истина;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	СчетчикБаллонов = 0;
	Для каждого строкаПартииБаллоны из ПартииБаллоны Цикл
		СчетчикБаллоновВПартии = 0;	
		Для Н =1 По 20 Цикл
			Если ЗначениеЗаполнено(строкаПартииБаллоны["Баллон"+н] ) Тогда				
				СчетчикБаллонов = СчетчикБаллонов+1;
				СчетчикБаллоновВПартии = СчетчикБаллоновВПартии+1;
			КонецЕсли;	
			//	строкаПартииБаллоны["Вес"+н]=ПереченьВесов[Н-1] ;
		КонецЦикла;
		строкаПартииБаллоны.КоличествоБаллоновВПартии = СчетчикБаллоновВПартии;
	КонецЦикла;
	КоличествоБаллоновВВыпуске = СчетчикБаллонов;
КонецПроцедуры