 
 
 Функция ПечатьПримныйАкт(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	 
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.ПолеСверху			= 10;
	ТабДок.ПолеСнизу				= 10;
	ТабДок.ПолеСправа			= 0;
	ТабДок.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабДок.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_М15";
	
	 //{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	 Макет = Документы.МГС_ВозвратБаллоновОтКонтрагентов.ПолучитьМакет("ПриемныйАкт");
	 Запрос = Новый Запрос;
	 Запрос.Текст =
	 "ВЫБРАТЬ
	 |	МГС_ВозвратБаллоновОтКонтрагентов.Контрагент КАК Контрагент,
	 |	МГС_ВозвратБаллоновОтКонтрагентов.Мастер КАК Мастер,
	 |	МГС_ВозвратБаллоновОтКонтрагентов.НомерАМ КАК НомерАМ,
	 |	МГС_ВозвратБаллоновОтКонтрагентов.НомерЖД КАК НомерЖД,
	 |	МГС_ВозвратБаллоновОтКонтрагентов.НомерКонтейнера КАК НомерКонтейнера,
	 |	МГС_ВозвратБаллоновОтКонтрагентов.Организация КАК Организация,
	 |	МГС_ВозвратБаллоновОтКонтрагентов.Приемосдатчик1 КАК Приемосдатчик1,
	 |	МГС_ВозвратБаллоновОтКонтрагентов.ДокументыОтгрузки.(
	 |		ТипБаллона КАК ТипБаллона,
	 |		Количество КАК Количество,
	 |		ЧислятсяПоОтправочнымДокументам КАК ЧислятсяПоОтправочнымДокументам
	 |	) КАК ДокументыОтгрузки,
	 |	МГС_ВозвратБаллоновОтКонтрагентов.Ссылка КАК Ссылка,
	 |	МГС_ВозвратБаллоновОтКонтрагентов.Номер КАК Номер,
	 |	МГС_ВозвратБаллоновОтКонтрагентов.Дата КАК Дата,
	 |	МГС_ВозвратБаллоновОтКонтрагентов.Комментарий КАК Комментарий
	 |ИЗ
	 |	Документ.МГС_ВозвратБаллоновОтКонтрагентов КАК МГС_ВозвратБаллоновОтКонтрагентов
	 |ГДЕ
	 |	МГС_ВозвратБаллоновОтКонтрагентов.Ссылка В(&Ссылка)";
	
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	 Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	 Выборка = Запрос.Выполнить().Выбрать();

	// ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	 ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	// ОбластьДокументыОтгрузкиШапка = Макет.ПолучитьОбласть("ДокументыОтгрузкиШапка");
	 ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	 ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

	 ТабДок.Очистить();

	 ВставлятьРазделительСтраниц = Ложь;
	 Пока Выборка.Следующий() Цикл
		 Если ВставлятьРазделительСтраниц Тогда
			 ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		 КонецЕсли;

		 //ТабДок.Вывести(ОбластьЗаголовок);

		 ОбластьШапка.Параметры.Заполнить(Выборка);
		 ОбластьШапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Ложь);
		 ОбластьШапка.Параметры.Организация = СокрЛП(Выборка.Организация.НаименованиеСокращенное);
		 
		 СведенияОКонтрагентах = Новый Структура();
		 СведенияОКонтрагентах.Вставить("Контрагент", БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Контрагент,      Выборка.Дата));
		 
		 ОбластьШапка.Параметры.Контрагент = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагентах.Контрагент,
		 "ПолноеНаименование,ФактическийАдрес");
		 ТабДок.Вывести(ОбластьШапка, Выборка.Уровень());
		 
		 // ТабДок.Вывести(ОбластьДокументыОтгрузкиШапка);
		 ВыборкаТипБаллона = Выборка.ДокументыОтгрузки.Выбрать();
		 Пока ВыборкаТипБаллона.Следующий() Цикл
			 ОбластьСтрока.Параметры.Заполнить(ВыборкаТипБаллона);
			 ТабДок.Вывести(ОбластьСтрока, ВыборкаТипБаллона.Уровень());
		 КонецЦикла;

		 ОбластьПодвал.Параметры.Заполнить(Выборка);
		 ДанныеФизЛицаМастер = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Выборка.Ссылка.Организация, Выборка.Ссылка.Мастер, Выборка.Ссылка.Дата);
		 ОбластьПодвал.Параметры.МастерДолжность = ДанныеФизЛицаМастер.Должность;
		 ОбластьПодвал.Параметры.Мастер =ДанныеФизЛицаМастер.Представление;
		 ДанныеФизЛицаПриемосдатчик1 = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Выборка.Ссылка.Организация, Выборка.Ссылка.Приемосдатчик1, Выборка.Ссылка.Дата);
		 ОбластьПодвал.Параметры.Приемосдатчик1Должность = ДанныеФизЛицаПриемосдатчик1.Должность;
		 ОбластьПодвал.Параметры.Приемосдатчик1 =ДанныеФизЛицаПриемосдатчик1.Представление;
		 ОбластьПодвал.Параметры.Комментарий =Выборка.Комментарий;
		 ТабДок.Вывести(ОбластьПодвал);

		 ВставлятьРазделительСтраниц = Истина;
	 КонецЦикла;
	 //}}
	 	Возврат ТабДок;
 КонецФункции
 //   	// ВставлятьРазделительСтраниц = Истина;
 //    КонецЦикла;
 //    
 //   Возврат ТабДок;
 //КонецФункции
 //
 // Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриемосдаточныйАкт") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПриемосдаточныйАкт", "Приемосдаточный акт", 
			ПечатьПримныйАкт(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"Документ.МГС_ВозвратБаллонов.ПриемныйАкт");
	КонецЕсли;
	
	
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода);
	
	КонецПроцедуры
	
	// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Приемосдаточный акт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПриемосдаточныйАкт";
	КомандаПечати.Представление = НСтр("ru = 'Приемосдаточный акт'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок = 10;
	

	Если ПравоДоступа("Использование", Метаданные.Отчеты.РеестрДокументов) Тогда
		// Реестр документов
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "Реестр";
		КомандаПечати.Представление = НСтр("ru = 'Реестр документов'");
		КомандаПечати.ЗаголовокФормы= НСтр("ru = 'Реестр документов ""Реализация (акт, накладная)""'");
		КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
		КомандаПечати.СписокФорм    = "ФормаСписка";
		КомандаПечати.ДополнительныеПараметры.Вставить("НеВыводитьВКомплекте",Истина);
		КомандаПечати.Порядок       = 160;
	КонецЕсли;
	
КонецПроцедуры

