Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	//Если ДанныеЗаполнения<> Неопределено Тогда
	//	ЭтотОбъект.Организация = ДанныеЗаполнения.Организация;
	//	ЭтотОбъект.ДокументВыпуск = ДанныеЗаполнения;
	//КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр МГС_ВыпускБаллонов
	//Движения.МГС_ВыпускБаллонов.Записывать = Истина;
	//Для Каждого ТекСтрокаБаллоны Из Баллоны Цикл
	//	Движение = Движения.МГС_ВыпускБаллонов.Добавить();
	//	Движение.Период = Дата;
	//	Движение.Баллон = ТекСтрокаБаллоны.Баллон;
	//	//Движение.Партия = ТекСтрокаБаллоны.Партия;
	//	//Движение.Выпуск = ТекСтрокаБаллоны.Выпуск;
	//	Движение.Состояние =Перечисления.МГС_СостояниеБаллона.Возвращено;
	//	//	Движение.Номенклатура = Номенклатура;
	//КонецЦикла;

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.Ссылка КАК Ссылка,
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.НомерСтроки КАК НомерСтроки,
	//	|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.ТипБаллона КАК ТипБаллона,
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.Количество КАК Количество
		|ИЗ
		|	Документ.МГС_ВозвратБаллоновОтКонтрагентов.ДокументыОтгрузки КАК МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки
		|ГДЕ
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Движения.МГС_БаллоныУКонтрагентов.Записывать = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Движение = Движения.МГС_БаллоныУКонтрагентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ТипБаллона = ВыборкаДетальныеЗаписи.ТипБаллона;
	//	Движение.ДокументОтгрузки = ВыборкаДетальныеЗаписи.ДокументОтгрузки;
		Движение.Контрагент = Контрагент;
		Движение.Количество =ВыборкаДетальныеЗаписи.Количество;
	
	КонецЦикла;
	Движения.МГС_БаллоныУКонтрагентов.Записать();
	Движения.МГС_БаллоныУКонтрагентов.БлокироватьДляИзменения =  истина;
	
	
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.ТипБаллона КАК ТипБаллона
		|ПОМЕСТИТЬ ВТ_ОтгрузкаБаллоны
		|ИЗ
		|	Документ.МГС_ВозвратБаллоновОтКонтрагентов.ДокументыОтгрузки КАК МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки
		|ГДЕ
		|	МГС_ВозвратБаллоновОтКонтрагентовДокументыОтгрузки.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МГС_БаллоныУКонтрагентовОстатки.Организация КАК Организация,
		|	МГС_БаллоныУКонтрагентовОстатки.ТипБаллона КАК ТипБаллона,
		|	МГС_БаллоныУКонтрагентовОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	МГС_БаллоныУКонтрагентовОстатки.ТипБаллона.Представление КАК ТипБаллонаПредставление
		|ИЗ
		|	РегистрНакопления.МГС_БаллоныУКонтрагентов.Остатки(
		|			&Граница,
		|			ТипБаллона В
		|					(ВЫБРАТЬ
		|						ВТ_ОтгрузкаБаллоны.ТипБаллона
		|					ИЗ
		|						ВТ_ОтгрузкаБаллоны КАК ВТ_ОтгрузкаБаллоны)
		|				И Организация = &Организация
		|				И Контрагент = &Контрагент) КАК МГС_БаллоныУКонтрагентовОстатки
		|ГДЕ
		|	МГС_БаллоныУКонтрагентовОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//	Отказ =  истина;
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Остаток по "+ ВыборкаДетальныеЗаписи.ТипБаллонаПредставление 
	//	+" стал отрицательным (" 	+ВыборкаДетальныеЗаписи.КоличествоОстаток +")" ;
	//	//Сообщение.Поле = "";
	//	//Сообщение.УстановитьДанные();
	//	Сообщение.Сообщить();
	//КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	КоличествоБаллоновВозвращено = ДокументыОтгрузки.Итог("Количество");
КонецПроцедуры





