Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	//Если ДанныеЗаполнения<> Неопределено Тогда
	//	ЭтотОбъект.Организация = ДанныеЗаполнения.Организация;
	//	ЭтотОбъект.ДокументВыпуск = ДанныеЗаполнения;
	//КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МГС_ГидроиспытаниеБаллонов.Баллон КАК Баллон
		|ИЗ
		|	Документ.МГС_ГидроиспытаниеБаллонов.Баллоны КАК МГС_ГидроиспытаниеБаллонов
		|ГДЕ
		|	МГС_ГидроиспытаниеБаллонов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Запись = РегистрыСведений.МГС_АттестацияБаллонов.СоздатьМенеджерЗаписи();	
		Запись.Период = Дата;
		Запись.Баллон = ВыборкаДетальныеЗаписи.Баллон;
		Запись.ДатаСледующейАттестации =ДобавитьМесяц(Дата,60) ;
		Запись.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Вставить содержимое обработчика.
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МГС_ГидроиспытаниеБаллонов.Баллон КАК Баллон
		|ИЗ
		|	Документ.МГС_ГидроиспытаниеБаллонов.Баллоны КАК МГС_ГидроиспытаниеБаллонов
		|ГДЕ
		|	МГС_ГидроиспытаниеБаллонов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Запись = РегистрыСведений.МГС_АттестацияБаллонов.СоздатьМенеджерЗаписи();	
		Запись.Период = Дата;
		Запись.Баллон = ВыборкаДетальныеЗаписи.Баллон;
		Запись.ДатаСледующейАттестации =ДобавитьМесяц(Дата,60) ;
		Запись.Записать(Истина);
		
		Запись.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
	
	Для каждого СтрокаБаллоны Из Баллоны Цикл
		Если СтрокаБаллоны.Баллон.ДатаИзготовления = '00010101000000' Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Откройте данный баллон и установите дату изготовления";
			Сообщение.Поле = "Баллоны["+Строка(СтрокаБаллоны.НомерСтроки-1)+"].Баллон";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Отказ = истина
		КонецЕсли; 
		
	
	КонецЦикла; 
КонецПроцедуры










