

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	//Если Команда.Имя = "ПодменюПечатьОбычное_Реестр" Тогда
	//	НастройкиДинамическогоСписка();
	//КонецЕсли;
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры
