&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораПоБаллонам(Текст, Период) Экспорт
    
	спВыбора    =    Новый СписокЗначений;
	
	Текст = СтрЗаменить(Текст," ","");
	
	Запрос    =    Новый Запрос;
	Запрос.Текст    =    "ВЫБРАТЬ
	                     |	МГС_Баллоны.Ссылка КАК Ссылка,
	                     |	МГС_Баллоны.ВесТары КАК ВесТары
	                     |ПОМЕСТИТЬ Вт_Баллоны
	                     |ИЗ
	                     |	Справочник.МГС_Баллоны КАК МГС_Баллоны
	                     |ГДЕ
	                     |	МГС_Баллоны.Наименование ПОДОБНО &Наименование
	    //                 |	И МГС_Баллоны.ТипБаллона = &ТипБаллона
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	МГС_АттестацияБаллоновСрезПоследних.ДатаСледующейАттестации КАК ДатаСледующейАттестации,
	                     |	Вт_Баллоны.Ссылка КАК Ссылка,
	                     |	Вт_Баллоны.Ссылка.Наименование КАК Наименование,
	                     |	Вт_Баллоны.ВесТары КАК ВесТары
	                     |ИЗ
	                     |	Вт_Баллоны КАК Вт_Баллоны
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МГС_АттестацияБаллонов.СрезПоследних(
	                     |				&Период,
	                     |				Баллон В
	                     |					(ВЫБРАТЬ
	                     |						Вт_Баллоны.Ссылка
	                     |					ИЗ
	                     |						Вт_Баллоны КАК Вт_Баллоны)) КАК МГС_АттестацияБаллоновСрезПоследних
	                     |		ПО Вт_Баллоны.Ссылка = МГС_АттестацияБаллоновСрезПоследних.Баллон";
	                    
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Наименование", Текст);    
	//Запрос.УстановитьПараметр("ТипБаллона", ТипБаллона);   
	Выборка    =    Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл      
	    ПредставлениеБаллона    =    Выборка.Наименование+ " " +Выборка.ВесТары + " (" + Формат(Выборка.ДатаСледующейАттестации,"ДФ='MMMM yyyy'")  +")";	    
	    спВыбора.Добавить(Выборка.Ссылка, 
	                            ПредставлениеБаллона);    	
	КонецЦикла; 
	//спВыбора.Добавить(Текст,  "...ввести новый баллон...");    						
	Если спВыбора.Количество() = 0 Тогда
		спВыбора= Неопределено
	КонецЕсли;
    Возврат спВыбора;

КонецФункции // ПолучитьДанныеВыбораФИО()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	//ОбновитьВидимостьЗакрытияОткрытияАнализа();
	//Вставить содержимое обработчика
КонецПроцедуры


//&НаСервере
//Процедура ОбновитьВидимостьЗакрытияОткрытияАнализа()
//	
//	// Вставить содержимое обработчика.
//	Если Объект.Проведен Тогда	
//		
//		Элементы.АнализОдобрен.Видимость = Ложь;
//		//ЭтаФорма.ТолькоПросмотр = Истина;
//		
//		Для каждого Элемент из ЭтаФорма.Элементы Цикл
//			Если Элемент. имя ="ГруппаСтандартныхКоманд"
//			Или Элемент. имя ="ОткрытьАнализ"
//			Или Элемент. имя ="КоманднаяПанельФормы"
//			Или Элемент. имя ="ФормаКоманднаяПанель"
//			Или СтрНайти(Элемент. имя,"Печат")>0
//			Или СтрНайти(Элемент. имя,"СоздатьНаОсновании")>0
//			или  ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
//				Продолжить;
//			КонецЕсли;
//			Элемент.Доступность=Ложь
//		КонецЦикла;
//		Элементы.ОткрытьАнализ.Видимость = Истина;
//		Элементы.ОткрытьАнализ.Доступность = Истина;
//	Иначе
//		Элементы.АнализОдобрен.Видимость = Истина;
//		Для каждого Элемент из ЭтаФорма.Элементы Цикл
//			Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
//				Продолжить;
//			КонецЕсли;
//			Элемент.Доступность=Истина
//		КонецЦикла;
//		Элементы.ОткрытьАнализ.Видимость = Ложь;
//		Элементы.ОткрытьАнализ.Доступность = Ложь;
//	КонецЕсли;
//КонецПроцедуры



&НаКлиенте
Процедура БаллоныБаллонОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ДанныеВыбора = ПолучитьДанныеВыбораПоБаллонам(Текст, Объект.Дата); 
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура БаллоныБаллонИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
//	СтандартнаяОбработка = Ложь
КонецПроцедуры

&НаКлиенте
Процедура БаллоныБаллонАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
		ДанныеВыбора    =    ПолучитьДанныеВыбораПоБаллонам(Текст, объект.Дата);
	Если ДанныеВыбора <> Неопределено Тогда			
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Вставить содержимое обработчика.
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры





