


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	Если ДанныеЗаполнения<> Неопределено Тогда
		//ЭтотОбъект.Организация = ДанныеЗаполнения.Организация;
		ЭтотОбъект.ДокументВыпуск = ДанныеЗаполнения;
		ЭтотОбъект.Дата= ЭтотОбъект.ДокументВыпуск.Дата+1;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.МГС_ВыпускБаллонов.Записывать = Истина;
	Для Каждого ТекСтрокаБаллоны Из Баллоны Цикл
		Движение = Движения.МГС_ВыпускБаллонов.Добавить();
		Движение.Период = Дата;
		Движение.Баллон = ТекСтрокаБаллоны.Баллон;
		//Движение.Партия = ТекСтрокаБаллоны.Партия;
		Движение.Выпуск = ДокументВыпуск;
		Движение.Состояние =Перечисления.МГС_СостояниеБаллона.Забракованно;
		
	КонецЦикла;
КонецПроцедуры

//Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	// Вставить содержимое обработчика.
//	Если Сертификация.Количество() > 0 и Партии.Количество() = 0 Тогда
//		Для каждого ТекущаяПартия   Из ДокументВыпуск.ПартииБаллоны Цикл
//			НоваяСтрокаПартии = Партии.Добавить();
//			НоваяСтрокаПартии.НомерПартии =ТекущаяПартия.НомерПартии; 	
//		КонецЦикла; 	
//	КонецЕсли; 
//КонецПроцедуры







