


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	Если ДанныеЗаполнения<> Неопределено Тогда
		ЭтотОбъект.Организация = ДанныеЗаполнения.Организация;
		ЭтотОбъект.ДокументВыпуск = ДанныеЗаполнения;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр МГС_РезультатАнализа
	Движения.МГС_РезультатАнализа.Записывать = Истина;
	Если ДокументВыпуск.ТипВыпуска =  Справочники.МГС_ТипыВыпускаБаллонов.Медицинский	 Тогда
		Для каждого ТекущаяПартия   Из ДокументВыпуск.ПартииБаллоны Цикл
			Движение = Движения.МГС_РезультатАнализа.Добавить();
			Движение.Выпуск = ДокументВыпуск;
			Движение.Партия = ТекущаяПартия.НомерПартии;	
		КонецЦикла; 
		
	иначе 
		Для каждого ТекущаяПартия   Из Партии Цикл
			Движение = Движения.МГС_РезультатАнализа.Добавить();
			Движение.Выпуск = ДокументВыпуск;
			Движение.Партия = ТекущаяПартия.НомерПартии;	
		КонецЦикла; 
	КонецЕсли; 
	
	
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	Если Сертификация.Количество() > 0 и Партии.Количество() = 0 Тогда
		Для каждого ТекущаяПартия   Из ДокументВыпуск.ПартииБаллоны Цикл
			НоваяСтрокаПартии = Партии.Добавить();
			НоваяСтрокаПартии.НомерПартии =ТекущаяПартия.НомерПартии; 	
		КонецЦикла; 	
	КонецЕсли; 
КонецПроцедуры







